## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_firewall_policy.fwpolicy must be replaced
-/+ resource "azurerm_firewall_policy" "fwpolicy" {
      - auto_learn_private_ranges_enabled = false -> null
      ~ child_policies                    = [] -> (known after apply)
      ~ firewalls                         = [] -> (known after apply)
      ~ id                                = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/RG_BP_HUB_Vnet_Prod/providers/Microsoft.Network/firewallPolicies/fwpolicy" -> (known after apply)
        name                              = "fwpolicy"
      - private_ip_ranges                 = [] -> null
      ~ rule_collection_groups            = [] -> (known after apply)
      ~ sku                               = "Standard" -> "Premium" # forces replacement
      - tags                              = {} -> null
        # (4 unchanged attributes hidden)

      + intrusion_detection {
          + mode = "Deny"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>